Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Пользователи системы</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Comment>Флаг активности пользователя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаРазмещения</Name>
					<Comment>Местонахождение группы или подразделения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиРазмещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьИБ</Name>
					<Comment>Учетная запись информационной базы с которой олицетворен пользователь</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияПараметр</Name>
					<Comment>Параметр аутентификации пользователя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияСтандартная</Name>
					<Comment>Тип аутентификации пользователя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уведомлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>96</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопРеквизитАдресации</Name>
					<Comment>Используется в бизнес-процессе "Обратная связь лояльности" для постановки и отбора задач</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриОткрытииПоказыватьЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Полномочия</Name>
					<Comment>Полномочия пользователя</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Доступные подразделения</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Comment>Доступ к иерархии подразделения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеЦелевыеТочки</Name>
					<Comment>Целевые точки, которые доступны дополнительно, не зависимо от достуных подразделений</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦелеваяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеОбщиеОчереди</Name>
					<Comment>Очереди, не привязанные к целевым точкам, но включающие агентов целевых звонков (общие очереди)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ДоступСервер/Ext/Module.bsl
Функция ДоступныеЦелевыеТочки(Пользователь)Экспорт
	//Назначение: возвращает список доступных пользователю на чтение целевых точек. Они указываются в табл. части  ДоступныеЦелевыеТочки справочника Пользователи
	//Если табл. часть ДоступныеЦелевыеТочки справочника Пользователи пустая, тогда возвращаются все целевые точки
	//Игнорируются целевые точки, не привязанные к очередям
	
	ДоступныеЦелевыеТочки = Новый СписокЗначений();
	
	Доступно = ТипЗнч(Пользователь)=Тип("СправочникСсылка.Пользователи");
	Если Не Доступно Тогда
		Возврат ДоступныеЦелевыеТочки;
	КонецЕсли; 
		
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПользователиДоступныеЦелевыеТочки.ЦелеваяТочка КАК ЦелеваяТочка,
	|	ПользователиДоступныеЦелевыеТочки.ЦелеваяТочка.Наименование КАК ЦелеваяТочкаНаименование
	|ИЗ
	|	Справочник.Пользователи.ДоступныеЦелевыеТочки КАК ПользователиДоступныеЦелевыеТочки
	|ГДЕ
	|	ПользователиДоступныеЦелевыеТочки.Ссылка = &Ссылка
	|	И ПользователиДоступныеЦелевыеТочки.ЦелеваяТочка.ПометкаУдаления = ЛОЖЬ
	|	И НЕ ПользователиДоступныеЦелевыеТочки.ЦелеваяТочка.Очередь = ЗНАЧЕНИЕ(Справочник.ТелОчереди.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦелеваяТочкаНаименование";
	Запрос.УстановитьПараметр("Ссылка", Пользователь);
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл			
			ДоступныеЦелевыеТочки.Добавить(Выборка.ЦелеваяТочка);
	КонецЦикла;
	
	Если ДоступныеЦелевыеТочки.Количество()>0 Тогда	
		Возврат ДоступныеЦелевыеТочки;
	КонецЕсли;
	
	//Если список доступных целевых точек - пуст, тогда доступны все
	//--------------------------------------------------------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТочкиЦелевые.Ссылка КАК ЦелеваяТочка,
	|	ТочкиЦелевые.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ТочкиЦелевые КАК ТочкиЦелевые
	|ГДЕ
	|	ТочкиЦелевые.ПометкаУдаления = ЛОЖЬ
	|	И НЕ ТочкиЦелевые.Очередь = ЗНАЧЕНИЕ(Справочник.ТелОчереди.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";	
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДоступныеЦелевыеТочки.Добавить(Выборка.ЦелеваяТочка);
	КонецЦикла;	
	
	Возврат ДоступныеЦелевыеТочки;

КонецФункции

Функция ДоступныеЦелевыеОчереди(Пользователь) Экспорт
	//Назначение: возвращает список доступных пользователю на чтение целевых очередий. Они определяются 
	// через доступные целевые точки в табл. части  ДоступныеЦелевыеТочки справочника Пользователи
	//Если табл. часть ДоступныеЦелевыеТочки справочника Пользователи пустая, тогда возвращаются все целевые точки
	//Игнорируются целевые точки, не привязанные к очередям
	//НЕ ВОЗВРАЩАЕТ ДОСТУПНЫЕ ОБЩИЕ ОЧЕРЕДИ
	
	ДоступныеЦелевыеОчереди = Новый СписокЗначений();
	
	Доступно = ТипЗнч(Пользователь)=Тип("СправочникСсылка.Пользователи");
	Если Не Доступно Тогда
		Возврат ДоступныеЦелевыеОчереди;
	КонецЕсли; 
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.ЦелеваяТочка.Очередь КАК Очередь,
	|	Т.ЦелеваяТочка.Наименование КАК ЦелеваяТочкаНаименование
	|ИЗ
	|	Справочник.Пользователи.ДоступныеЦелевыеТочки КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|	И НЕ Т.ЦелеваяТочка.ПометкаУдаления
	|	И НЕ Т.ЦелеваяТочка.Очередь = ЗНАЧЕНИЕ(Справочник.ТелОчереди.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦелеваяТочкаНаименование";
	Запрос.УстановитьПараметр("Ссылка", Пользователь);
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
			ДоступныеЦелевыеОчереди.Добавить(Выборка.Очередь);
	КонецЦикла;
	
	Если ДоступныеЦелевыеОчереди.Количество()>0 Тогда
		Возврат ДоступныеЦелевыеОчереди;
	КонецЕсли;
	
	//Если список доступных целевых точек - пуст, тогда доступны все
	//--------------------------------------------------------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.Очередь КАК Очередь, Т.Наименование КАК Наименование ИЗ Справочник.ТочкиЦелевые КАК Т
	|ГДЕ
	|	НЕ Т.ПометкаУдаления
	|	И НЕ Т.Очередь = ЗНАЧЕНИЕ(Справочник.ТелОчереди.ПустаяСсылка)
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";	
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДоступныеЦелевыеОчереди.Добавить(Выборка.Очередь);	
	КонецЦикла;	
	
	Возврат ДоступныеЦелевыеОчереди;
КонецФункции

Функция  ДоступныеЦелевыеИОбщиеОчереди(Пользователь) Экспорт
	//Назначение: возвращает список доступных пользователю на чтение целевых очередий. Они определяются 
	// через доступные целевые точки в табл. части  ДоступныеЦелевыеТочки справочника Пользователи
	//Если табл. часть ДоступныеЦелевыеТочки справочника Пользователи пустая, тогда возвращаются все целевые точки
	//Игнорируются целевые точки, не привязанные к очередям
	//ВОЗВРАЩАЕТ ТАКЖЕ ДОСТУПНЫЕ ОБЩИЕ ОЧЕРЕДИ
	
	ДоступныеЦелевыеОчереди = ДоступныеЦелевыеОчереди(Пользователь);
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПользователиДоступныеОбщиеОчереди.Очередь КАК Очередь
	|ИЗ
	|	Справочник.Пользователи.ДоступныеОбщиеОчереди КАК ПользователиДоступныеОбщиеОчереди
	|ГДЕ
	|	ПользователиДоступныеОбщиеОчереди.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Пользователь);
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);	
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ДоступныеЦелевыеОчереди;	
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ДоступныеЦелевыеОчереди.НайтиПоЗначению(Выборка.Очередь) = Неопределено Тогда
			ДоступныеЦелевыеОчереди.Добавить(Выборка.Очередь);
		КонецЕсли;
	КонецЦикла;
		
	Возврат ДоступныеЦелевыеОчереди;

КонецФункции
